{"metadata":{"date":"Sep 27, 2015","title":"TV-shows I'm following","template":"post","slug":"tv-series-im-following","categories":["Personal"],"tags":["Personal"]},"content":"<p>There are so many awesome tv-shows out there it's hard to know where to start. I will list shows I have finished watching that I find are very good. Perhaps you will find something interesting.</p>\n<p>If you have any tips, drop a comment :)</p>\n<h2>Shows that have ended</h2>\n<h3>Battlestar Galactica (4 seasons)</h3>\n<p><img src=\"../images/battlestar-galactica.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> When an old enemy, the Cylons, resurfaces and obliterate the 12 colonies, the crew of the aged Galactica protects a small civilian fleet - the last of humanity - as they journey toward the fabled 13th colony of Earth.</p>\n<h3>Fringe (5 seasons)</h3>\n<p><img src=\"../images/fringe.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A female FBI agent is forced to work with an institutionalized scientist and his son in order to rationalize a brewing storm of unexplained phenomena.</p>\n<h3>Stargate-SG1 (10 seasons)</h3>\n<p><img src=\"../images/sg1.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A secret military team, SG-1, is formed to explore the recently discovered Stargates.</p>\n<h3>Firefly (1 season)</h3>\n<p><img src=\"../images/firefly.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Five hundred years in the future, a renegade crew aboard a small spacecraft tries to survive as they travel the unknown parts of the galaxy and evade warring factions as well as authority agents out to get them.</p>\n<h3>Person of Interest (5 seasons)</h3>\n<p><img src=\"../images/poi.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> An ex-assassin and a wealthy programmer save lives via a surveillance AI that sends them the identities of civilians involved in impending crimes. However, the details of the crimes--including the civilians' roles--are left a mystery.</p>\n<h3>Breaking Bad (5 seasons)</h3>\n<p><img src=\"../images/breaking-bad.jpg\" alt=\"\">\n<strong>IMDB:</strong> A chemistry teacher diagnosed with terminal lung cancer teams up with his former student to cook and sell crystal meth.</p>\n<h3>True Blood (7 seasons)</h3>\n<p><img src=\"../images/true-blood.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Telepathic waitress Sookie Stackhouse encounters a strange new supernatural world when she meets the mysterious Bill, a southern Louisiana gentleman and vampire.</p>\n<h3>Doctor Who (2005)</h3>\n<p><img src=\"../images/dr-who.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> The further adventures of the time traveling alien adventurer and his companions.</p>\n<h3>Smallville (10 seasons)</h3>\n<p><img src=\"../images/smallville.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A young Clark Kent struggles to find his place in the world as he learns to harness his alien powers for good and deals with the typical troubles of teenage life in Smallville.</p>\n<h3>Orphan Black (4 seasons)</h3>\n<p><img src=\"../images/orphan-black.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A streetwise hustler is pulled into a compelling conspiracy after witnessing the suicide of a girl who looks just like her.</p>\n<h3>Orange is the new black (4 seasons)</h3>\n<p><img src=\"../images/orange-is-the-new-black.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> The story of Piper Chapman, a woman in her thirties who is sentenced to fifteen months in prison after being convicted of a decade-old crime of transporting money to her drug-dealing girlfriend.</p>\n<h3>Luther (4 seasons)</h3>\n<p><img src=\"../images/luther.jpg\" alt=\"\">\n<strong>IMDB:</strong> A crime drama series starring Idris Elba as a near-genius murder detective whose brilliant mind can't always save him from the dangerous violence of his passions.</p>\n<h2>Shows TBA</h2>\n<h3>The Flash (4 seasons)</h3>\n<p><img src=\"../images/the_flash.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Barry Allen wakes up 9 months after he was struck by lightning and discovers that the bolt gave him the power of super speed. With his new team and powers, Barry becomes \"The Flash\" and fights crime in Central City.</p>\n<h3>Mr. Robot (2 seasons)</h3>\n<p><img src=\"../images/mr-robot.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Follows a young computer programmer who suffers from social anxiety disorder and forms connections through hacking. He's recruited by a mysterious anarchist, who calls himself Mr. Robot.</p>\n<h3>Game of Thrones (6 seasons)</h3>\n<p><img src=\"../images/got.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Several noble families fight for control of the mythical land of Westeros.</p>\n<h2>Currently Watching</h2>\n<h3>Continuum (4 seasons)</h3>\n<p><img src=\"../images/continuum.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A detective from the year 2077 finds herself trapped in present day Vancouver and searching for ruthless criminals from the future.</p>\n<h3>The Strain (3 seasons)</h3>\n<p><img src=\"../images/the-strain.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> A thriller that tells the story of Dr. Ephraim Goodweather, the head of the Center for Disease Control Canary Team in New York City. He and his team are called upon to investigate a mysterious viral outbreak with hallmarks of an ancient and evil strain of vampirism. As the strain spreads, Eph, his team, and an assembly of everyday New Yorkers, wage war for the fate of humanity itself.</p>\n<h3>The Walking Dead (6 seasons)</h3>\n<p><img src=\"../images/walking-dead.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> Sheriff Deputy Rick Grimes leads a group of survivors in a world overrun by zombies.</p>\n<h3>Gotham (2 seasons)</h3>\n<p><img src=\"../images/gotham.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> The story behind Commissioner James Gordon's rise to prominence in Gotham City in the years before Batman's arrival.</p>\n<h3>Fear of the walking dead (1 season)</h3>\n<p><img src=\"../images/fear-walking-dead.jpg\" alt=\"\"></p>\n<p><strong>IMDB:</strong> What did the world look like as it was transforming into the horrifying apocalypse depicted in \"The Walking Dead\"? This spin-off set in Los Angeles, following new characters as they face the beginning of the end of the world, will answer that question.</p>\n<h2>Shows I'm planning to see</h2>\n<ul>\n<li>Vikings</li>\n<li>Better Call Saul (spin-off of Breaking Bad)</li>\n<li>Heroes Reborn</li>\n<li>Narco</li>\n</ul>"}