{"metadata":{"date":"May 2, 2015","title":"Digital Steganography","template":"post","slug":"steganography","categories":["Steganography"],"tags":["Steganography"]},"content":"<p>There are many ways to conceal a message from untrusted entities, encryption is the far most used method for making sure no one but the intended receiver can read the message. However, there is an other method not widely used today and that is <strong>Steganography</strong>. In historical times people hid secret messages in all kinds of places where guards for example wouldn't look. I remember reading about a method where a \"king\" would have one his messengers shave their head and then they would write the message on the head and wait for the hair to grow back. Whoever waited for this message wasn't in a hurry...</p>\n<p>This is the purpose of steganography, to hide a message in plain sight and not arouse suspicion to a hidden message.</p>\n<h3>Why not use encryption?</h3>\n<p>The the purpose of encryption is to encrypt a message and make it unreadable, transfer the message to the intended recipient who is the only one who can decrypt the message. If someone intercepts the message in transit, they will immediately get suspicious because of the encrypted message. They may even try to break it. This is where steganography differs, since its purpose is to not attract attention to the hidden message.</p>\n<h3>Should I use steganography instead of encryption?</h3>\n<p>No, you shouldn't. It all comes down to the level of secrecy you want to obtain. For most purposes regular encryption is fine, but if you want to transmit your message to your friend without arousing suspicion to the encrypted message, than perhaps steganography is something worth looking into.</p>\n<p>You could also combine the best of both worlds, hiding an encrypted message within an image for example.</p>\n<h3>So people still shave their heads today as well?</h3>\n<p>Not quite, modern steganography is mostly used in the digital world, hiding data in images, audio, network packets, video and documents.</p>\n<h3>Hiding data within images</h3>\n<p>The most popular way of hiding data in images is the LSB (Least Significant Bit) method.</p>\n<p>The following image may help you understand how pixels and LSB work.</p>\n<p><img src=\"../images/Untitled-1-2.png\" alt=\"\"></p>\n<p>Lets say you have the following 3 pixels:</p>\n<pre><code class=\"hljs language-ldif\"><span class=\"hljs-attribute\">RED</span>: 01100001\n<span class=\"hljs-attribute\">GREEN</span>: 01101010\n<span class=\"hljs-attribute\">BLUE</span>: 01100110\n<span class=\"hljs-literal\">-</span>\n<span class=\"hljs-attribute\">RED</span>: 01110000\n<span class=\"hljs-attribute\">GREEN</span>: 01100010\n<span class=\"hljs-attribute\">BLUE</span>: 01100111\n<span class=\"hljs-literal\">-</span>\n<span class=\"hljs-attribute\">RED</span>: 01101001\n<span class=\"hljs-attribute\">GREEN</span>: 01110100\n<span class=\"hljs-attribute\">BLUE</span>: 01101000\n</code></pre>\n<p>And you want to hide the following message:\n<code>01110101</code></p>\n<p>Basically you would substitute each bit in your message with the LSB bit in each color channel.</p>\n<pre><code class=\"hljs language-apache\"><span class=\"hljs-attribute\">RED</span>: <span class=\"hljs-number\">0110000</span>[<span class=\"hljs-number\">0</span>]\n<span class=\"hljs-attribute\">GREEN</span>: <span class=\"hljs-number\">0110101</span>[<span class=\"hljs-number\">1</span>]\n<span class=\"hljs-attribute\">BLUE</span>: <span class=\"hljs-number\">0110011</span>[<span class=\"hljs-number\">1</span>]\n-\n<span class=\"hljs-attribute\">RED</span>: <span class=\"hljs-number\">0111000</span>[<span class=\"hljs-number\">1</span>]\n<span class=\"hljs-attribute\">GREEN</span>: <span class=\"hljs-number\">0110001</span>[<span class=\"hljs-number\">0</span>]\n<span class=\"hljs-attribute\">BLUE</span>: <span class=\"hljs-number\">0110011</span>[<span class=\"hljs-number\">1</span>]\n\n<span class=\"hljs-attribute\">RED</span>: <span class=\"hljs-number\">0110100</span>[<span class=\"hljs-number\">0</span>]\n<span class=\"hljs-attribute\">GREEN</span>: <span class=\"hljs-number\">0111010</span>[<span class=\"hljs-number\">1</span>]\n<span class=\"hljs-attribute\">BLUE</span>: <span class=\"hljs-number\">01101000</span>\n</code></pre>\n<p>As you can see the message has been encoded within the three pixels.</p>\n<p>This method is very secure against visual attacks, meaning you can't see any differences between the stego image and the original image. However, with statistical analysis it's easy to detect that the image has been tampered with. Why? Because you create large distortions when you modify each pixel channel.</p>\n<p>As you can see in the example above, I have only modified the LSB bits but the difference between the original and stego color is 65793 in the scale of colors. That is a major distortion.</p>\n<h3>Better ways to hide data?</h3>\n<p>There are plenty of better ways to hide data, but I'll save that for a future article ;)</p>\n<h5>References</h5>\n<p><a href=\"http://en.wikipedia.org/wiki/Steganography\">http://en.wikipedia.org/wiki/Steganography</a></p>"}