{"metadata":{"date":"Sep 15, 2015","title":"Basics of netstat","template":"post","slug":"disecting-netstat","categories":["Network Security"],"tags":["Network Security"]},"content":"<p>Netstat is a network tool available in most versions of Windwos, Mac OS X and Linux. You can use Netstat to view network information and statistics about the network you are currently connected to.</p>\n<p>You could view information about incoming/outgoing connections, routing table, protocol statistics and interfaces.</p>\n<p>On linux netstat has been deprecated, the command <code>ss</code> should be used instead. The difference between the two is that <code>ss</code> can display more information about TCP and connection states.</p>\n<h2>Running Netstat</h2>\n<p>Running netstat is as simple as writing <code>netstat</code> in your terminal. You should have some like this:</p>\n<p><img src=\"../images/Screen-Shot-2015-09-19-at-17-48-13.png\" alt=\"\"></p>\n<p>But what does the output mean? I'll walk you through it.</p>\n<h4>Proto</h4>\n<p>Indicates which protocol is being used, TCP or UDP for example.</p>\n<h4>Recv-Q</h4>\n<p>How many bytes the receiver has in their buffer not yet copied by the user program.</p>\n<h4>Send-Q</h4>\n<p>Amount of bytes sent but not acknowledged by the remote host.</p>\n<h4>Local Address</h4>\n<p>The port number and address of the local socket. Unless the <code>-n</code> argument is passed the address is translated to its FQDA and port number is translated to its corresponding service.</p>\n<h4>Foregin Address</h4>\n<p>Address and port number of remote host. (See local address)</p>\n<h4>State</h4>\n<p>The current state of the socket.</p>\n<h2>Some Commands</h2>\n<h5>List all ports</h5>\n<p><code>netstat -a</code></p>\n<h5>List all tcp ports</h5>\n<p><code>netstat -at</code></p>\n<h5>List all udp ports</h5>\n<p><code>netstat -au</code></p>\n<h5>List only listening ports</h5>\n<p><code>netstat -l</code></p>\n<h5>Show statistics for all ports</h5>\n<p><code>netstat -s</code></p>\n<h2>Conclusion</h2>\n<p>Netstat can be a great tool for identifying bottlenecks or checking for malicious incoming/outgoing connections. The Recv/Send queue can be great for network programmers to see if any bytes get stuck. Netstat could also be used for forensic analysis.</p>\n<h4>References</h4>\n<p><a href=\"http://linux.die.net/man/8/netstat\">http://linux.die.net/man/8/netstat</a></p>"}