{"metadata":{"date":"Apr 4, 2016","title":"Using Amazon S3 for your static site? One thing to keep in mind","template":"post","slug":"using-amazon-s3-for-your-static-site-theres-one-thing-to-keep-in-mind-2","categories":["Bug Bounty","System Administration"],"tags":["Bug Bounty","System Administration"]},"content":"<p>Amazon is a great service for hosting your static website. The way it works is by creating a S3 bucket with the name of your website, uploading your files to the bucket and changing the permissions so that the bucket can be read by the internet.</p>\n<p>So long as your domain points to this bucket, you are all good. However, as you may have realized, if you delete this bucket your website will display an error saying something like:</p>\n<pre><code class=\"hljs language-apache\"><span class=\"hljs-attribute\">Code</span>: NoSuchBucket\n<span class=\"hljs-attribute\">Message</span>: The specified bucket does not exist\n<span class=\"hljs-attribute\">BucketName</span>: www.yourdomainhere.com\n<span class=\"hljs-attribute\">RequestId</span>: <span class=\"hljs-number\">81</span>A<span class=\"hljs-number\">482</span>BC<span class=\"hljs-number\">4</span>A<span class=\"hljs-number\">49135</span>C\n<span class=\"hljs-attribute\">HostId</span>: fmi<span class=\"hljs-number\">7</span>A<span class=\"hljs-number\">3</span>bgEjRFxah/hxzyGx<span class=\"hljs-number\">1</span>FKy<span class=\"hljs-number\">5</span>Pte<span class=\"hljs-number\">3</span>+BK<span class=\"hljs-number\">6</span>TrNWcgy<span class=\"hljs-number\">9</span>KwsabLODfXZmGagnWkz<span class=\"hljs-number\">3</span>J\n</code></pre>\n<p>This is what some people don't think about, if your domain points to an empty bucket, nothing is stopping an attacker from creating a bucket with the same domain name as the victim. Now the attacker can serve any content under the victim's domain name, since the attacker owns the bucket.</p>\n<p>This was the exact scenario I experiences a couple of weeks ago. I found a website belonging to a developer who had done some bucket cleaning and deleted most of his buckets. However he forgot that his old domain was still active and now pointing to an empty bucket. I noticed this when I saw the bucket error on his website and tried to create a bucket with the same name as his domain, and it worked! I didn't do any thing malicious, I wrote Hello in index.html and the previous bucket error was gone and my content was showing.</p>\n<p>I reached out to the developer the next day on twitter explaining the situation, he was happy I detected the problem and asked me to hold on to the bucket until he got  time to fix it. Once I deleted the bucket he could create it and everything was alright again.</p>\n<h3>Conclusion</h3>\n<p>This can be a very stealthy attack depending on how it is executed and quite dangerous since it gives the attacker 100% control over the content served under the domain. It's also possible to create a script to find websites displaying the <code>NoSuchBucket</code> error and automatically creating the bucket.</p>\n<p>So, remember your buckets people!</p>"}