{"data":{"markdownRemark":{"html":"<p>Ever since Edward Snowden released top-secret material about the inner workings of the NSA and their capabilities, many have asked how you would travel the Internet free of mass surveillance.</p>\n<p>But why would you want to avoid surveillance every time you use a device that connects to the Internet? Every time you make a call or send a text message, to have this information recorded and stored? You wouldn’t do anything questionable or illegal, would you?</p>\n<blockquote>\n<p>If you have nothing to hide, you have nothing to fear.</p>\n</blockquote>\n<p>This argument always pops up when you are discussing surveillance of any form. The person who brings up this argument thinks that being monitored 24/7 is okay, and has no problem with it at all. I think that not only is this a dangerous mindset, but whoever conveys this argument falls under one (or more) of the following categories:</p>\n<ul>\n<li>They think that they themselves are not being monitored.</li>\n<li>They don't actually understand what information is being gathered.</li>\n<li>They are the ones doing the surveillance.</li>\n</ul>\n<p>I think there are some important counter-arguments that people need to think about. I will list them below:</p>\n<h3 id=\"leaders-change\"><a href=\"#leaders-change\" aria-label=\"leaders change permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Leaders change</h3>\n<p>The surveillance may be set in place to enforce the current status quo, but what happens when a new  political force comes in to office and pushes, for example, for homosexuality to be illegal again? The surveillance program will now be used to identify and arrest people for just being themselves.</p>\n<h3 id=\"inaccuracy\"><a href=\"#inaccuracy\" aria-label=\"inaccuracy permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Inaccuracy</h3>\n<p>Can an automated surveillance system calculate human behaviour? What if you would be stopping by a house that happens to be near a known drug area once a week? It would certainly create a pattern and would flag you as a probable drug dealer/buyer. Analysts would start looking at you more closely and watching every move you make. But in reality, you are just visiting an old friend.</p>\n<h3 id=\"breaking-the-law\"><a href=\"#breaking-the-law\" aria-label=\"breaking the law permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Breaking the law</h3>\n<p>Laws must be broken for society to progress. What if NSAs current surveillance level existed in the 1960s? Could lobby groups for social movements such as gay rights ever have formed? Would science have pioneered and progressed modern society from the dark ages if the authorities had the kind of global surveillance system we have today?</p>\n<h3 id=\"identify-resistance\"><a href=\"#identify-resistance\" aria-label=\"identify resistance permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Identify resistance</h3>\n<p>In one of the documents leaked by Snowden, the GCHQ points out clearly how they use their surveillance to exploit, manipulate and deceive people to destroy their reputation. If you would become a public figure opposing the government in some way, the GCHQ could look through everything you have done online and manipulate information and prosecute you.</p>\n<p>A great example of governments abusing their surveillance power, trying to stop social movements that upset the status quo, was Martin Luther King Jr. (MLK).</p>\n<p>MLK was an activist, pastor and leader in the African-American Civil Rights Movement. Unfortunately for MLK, he was made a target for a surveillance campaign by the FBI with the purpose  to neutralize him as a civil rights leader. The FBI wiretapped MLK and had his movements observed at all times. They also tried to discredit him by painting him as communist and accusing him of adultery.</p>\n<p>The Project MINARET was a program run by the NSA to monitor electronic communications of predesignated US citizens and hand over collected information to law enforcement. These citizens were on watch list generated by the law enforcement and intelligence agencies of the Executive Branch. NSA monitored communications of leading americans, including MLK, who criticized the U.S. war in Vietnam.</p>\n<p>NSA themselves later concluded that the project was \"disreputable if not outright illegal.\"</p>\n<p>You can read more here:\n<a href=\"http://www.theguardian.com/world/2013/sep/26/nsa-surveillance-anti-vietnam-muhammad-ali-mlk\">Declassified NSA files show agency spied on Muhammad Ali and MLK </a></p>\n<p><a href=\"https://www.eff.org/deeplinks/2014/11/fbis-suicide-letter-dr-martin-luther-king-jr-and-dangers-unchecked-surveillance\">FBI's \"Suicide Letter\" to Dr. Martin Luther King, Jr., and the Dangers of Unchecked Surveillance</a></p>\n<h3 id=\"privacy\"><a href=\"#privacy\" aria-label=\"privacy permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Privacy</h3>\n<p>Privacy is something we all want, it is a basic a human need: To be able to be alone, to search for any topic on the Internet and to read any books without being subject to ridicule or judgment.\nThis doesn't exist in today’s world where everything you do on the Internet is monitored. What is the reason for all this surveillance? In the event that you may do something illegal in the future. We are all guilty until proven innocent.</p>\n<p>Privacy means control over your information, your private property and communications, not being observed or disturbed by other people and free from public attention. One should be able to research embarrassing topics or maybe lifestyles which may not be fully compatible with mainstream social norms. If the government wants the people to give up their privacy rights, then politicians and government officials should do the same. They have nothing to fear, if they have nothing to hide.</p>\n<hr>\n<p>Governments maintain that surveillance is for our own protection, to keep us safe from terrorism. But is that really the true reason for monitoring all communications on the Internet?</p>\n<p>A good example of an organisation hiding its real agenda is from the Danish Anti-Piracy Group.</p>\n<blockquote>\n<p>The date was May 27, 2007, and the man was Johan Schlüter, head of the Danish Anti-Piracy Group (Antipiratgruppen). He was speaking in front of an audience from which the press had been banned; it was  supposed to be copyright industry insiders only. It wasn’t. Christian Engström, who is now a Member of the European Parliament, Oscar Swartz, and I myself were also there.</p>\n</blockquote>\n<blockquote>\n<p>“My friends,” Schlüter said. “We must filter the Internet to win over online file sharing. But politicians don’t understand that file sharing is bad, and this is a problem for us. Therefore, we must associate file sharing with child pornography. Because that’s something the politicians understand, and something they want to filter off the Internet.”</p>\n</blockquote>\n<blockquote>\n<p>“We are developing a child pornography filter in cooperation with the IFPI and the MPA so we can show politicians that filtering works,” he said. “Child pornography is an issue they understand.” Schlüter grinned broadly. - <a href=\"http://torrentfreak.com/the-copyright-lobby-absolutely-loves-child-pornography-110709/\">http://torrentfreak.com/the-copyright-lobby-absolutely-loves-child-pornography-110709/</a></p>\n</blockquote>\n<p>What is it that “surveillance states” want to enforce by disguising it as terrorism? The  answer is control, control over people. The Internet can be used as an effective propaganda machine.</p>\n<h2 id=\"reasons-for-surveillance\"><a href=\"#reasons-for-surveillance\" aria-label=\"reasons for surveillance permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Reasons for Surveillance</h2>\n<p>We live in a modern, interconnected  world, and not having the  means to carry out intelligence missions to track, prevent, and gather intel about criminals is unrealistic. As technology evolves, criminals get more and more  skilled in hiding their operations and this is why we have to make sure that we are ahead of them rather than being left behind.</p>\n<p>The problem with today’s mass surveillance programmes is that  they go unchecked and give governments unprecedented power and opportunity to abuse. The power to limit free speech and   curtail privacy is a too important issue to be left in the hands of greedy men. This is why we have to be vigilant and always hold our politicians accountable and raise our voices whenever  there is a need to do so.</p>","timeToRead":5,"excerpt":"Ever since Edward Snowden released top-secret material about the inner workings of the NSA and their capabilities, many have asked how you…","frontmatter":{"title":"No Such Agency","slug":"no-such-agency","date":"2015-02-18T00:00:00.000Z","categories":["NSA","Privacy","Surveillance"],"tags":["NSA","Privacy","Surveillance"],"template":"post"},"fields":{"nextTitle":"Hack The Box - Olympus Writeup","nextSlug":"/htb-olympus-writeup/","prevTitle":"Dashing Dashboard","prevSlug":"/dashing-dashboard/","slug":"/no-such-agency/","date":"2015-02-18T00:00:00.000Z"}}},"pageContext":{"slug":"/no-such-agency/"}}